 Create a dataset as follow in the table.

In [2]:
import pandas as pd
dataset = {
    "Tid": [i for i in range(1,11)],
    "Refund": ["Yes","No","No","Yes","No","No","Yes","No","No","No"],
    "Marital Status": ["Single","Married","Single","Married","Divorced","Married","Divorced","Single","Married","Single"],
    "Taxable Income": ["125K","100K","70K","120K","95K","60K","220K","85K","75K","90K"],
    "Cheat": ["No","No","No","No","Yes","No","No","Yes","No","Yes"]
}
df = pd.DataFrame(dataset)
df

   Tid Refund Marital Status Taxable Income Cheat
0    1    Yes         Single           125K    No
1    2     No        Married           100K    No
2    3     No         Single            70K    No
3    4    Yes        Married           120K    No
4    5     No       Divorced            95K   Yes
5    6     No        Married            60K    No
6    7    Yes       Divorced           220K    No
7    8     No         Single            85K   Yes
8    9     No        Married            75K    No
9   10     No         Single            90K   Yes

 From the above table that you have created, locate row 0, 4, 7 and 8 using DataFrame.

In [3]:
print(df.iloc[[0,4,7,8]])

   Tid Refund Marital Status Taxable Income Cheat
,0    1    Yes         Single           125K    No
,4    5     No       Divorced            95K   Yes
,7    8     No         Single            85K   Yes
,8    9     No        Married            75K    No

Navigate the DataFrame and do the following task for the table created in question 1: 
1. Select row from index 3 to 7. 
2. Select row from index 4 to 8, and column 2 to 4. 
3. Select all rows with column index 1 to 3 (include index 3 during selection).

In [4]:
print(df.iloc[3:8])
print(df.iloc[4:9, 2:5])
print(df.iloc[:, 1:4])

   Tid Refund Marital Status Taxable Income Cheat
,3    4    Yes        Married           120K    No
,4    5     No       Divorced            95K   Yes
,5    6     No        Married            60K    No
,6    7    Yes       Divorced           220K    No
,7    8     No         Single            85K   Yes
,  Marital Status Taxable Income Cheat
,4       Divorced            95K   Yes
,5        Married            60K    No
,6       Divorced           220K    No
,7         Single            85K   Yes
,8        Married            75K    No
,  Refund Marital Status Taxable Income
,0    Yes         Single           125K
,1     No        Married           100K
,2     No         Single            70K
,3    Yes        Married           120K
,4     No       Divorced            95K
,5     No        Married            60K
,6    Yes       Divorced           220K
,7     No         Single            85K
,8     No        Married            75K
,9     No         Single            90K

Read a csv file and display its first five rows.

In [6]:
import pandas as pd
data = pd.read_csv("Iris.csv")
df = pd.DataFrame(data)
print(df.head())

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
,0   1            5.1           3.5            1.4           0.2  Iris-setosa
,1   2            4.9           3.0            1.4           0.2  Iris-setosa
,2   3            4.7           3.2            1.3           0.2  Iris-setosa
,3   4            4.6           3.1            1.5           0.2  Iris-setosa
,4   5            5.0           3.6            1.4           0.2  Iris-setosa

 From the csv file (uploaded in the Q.4) delete row 4, and delete column 3. Display the 
result.

In [7]:
df = df.drop(3, axis=0)
df = df.drop("SepalWidthCm", axis=1)
print(df.head())

   Id  SepalLengthCm  PetalLengthCm  PetalWidthCm      Species
,0   1            5.1            1.4           0.2  Iris-setosa
,1   2            4.9            1.4           0.2  Iris-setosa
,2   3            4.7            1.3           0.2  Iris-setosa
,4   5            5.0            1.4           0.2  Iris-setosa
,5   6            5.4            1.7           0.4  Iris-setosa

Create a sample dataset (employees.csv) containing information about employees in a company. 
Shape (number of rows and columns) of the DataFrame. 
b) Summary of the DataFrame that includes the data types and non-null counts for 
each column. 
c) Generate descriptive statistics. 
d) Display the first 5 rows and last 3 rows of the dataset.  
e) Calculate the following statistics from the dataset: 
i. The average salary of employees. 
ii. The total bonus paid to all employees. 
iii. The youngest employee's age. 
iv. The highest performance rating. 
f) Sort the DataFrame by the Salary column in descending order. 
g) Add a new column that categorizes employees based on their performance rating: 
i. Excellent for ratings >= 4.5 
ii. Good for ratings >= 4.0 but < 4.5 
iii. Average for ratings < 4.0  
h) Identify missing values in the DataFrame. 
i) Rename the Employee_ID column to ID. 
j) Find all employees who: 
i. Have more than 5 years of experience. 
ii. Belong to the IT department. 
k) Modify the dataset by adding a new column, Tax, which deducts 10% of the 
Salary.  
l) Save the modified DataFrame (with added columns) to a new CSV file.

In [9]:
df = pd.read_csv("employees.csv")
print(df.shape)
print(df.info())
print(df.describe())
print(df.head(5))
print(df.tail(3))
print(f"Average Salary: {df["Salary"].mean()}")
print(f"Total Bonus: {df["Bonus"].sum()}")
print(f"Minimum Age: {df["Age"].min()}")
print(f"Highest Performance Rating: {df["Rating"].max()}")
sorted_df = df.sort_values(by = "Salary", ascending=False)
df["Performance_category"] = pd.cut(df["Rating"], bins = [0, 4, 4.5, 5], labels=["Average","Good","Excellent"], right=False)
missing_values = df.isnull().sum()
df.rename(columns={"Employee_ID":"ID"},  inplace=True)
print(df[df['Years_of_Experience'] > 5])
print(df[df['Department'] == 'IT'])
df['Tax'] = df['Salary'] * 0.10
df.to_csv('modified_employees.csv', index=False)

(5, 10)
,<class 'pandas.core.frame.DataFrame'>
,RangeIndex: 5 entries, 0 to 4
,Data columns (total 10 columns):
, #   Column               Non-Null Count  Dtype
,---  ------               --------------  -----
, 0   Employee_ID          5 non-null      int64
, 1   Name                 5 non-null      object
, 2   Department           5 non-null      object
, 3   Age                  5 non-null      int64
, 4   Salary               5 non-null      int64
, 5   Years_of_Experience  5 non-null      int64
, 6   Joining_date         5 non-null      object
, 7   Gender               5 non-null      object
, 8   Bonus                5 non-null      int64
, 9   Rating               5 non-null      float64
,dtypes: float64(1), int64(5), object(4)
,memory usage: 532.0+ bytes
,None
,       Employee_ID        Age       Salary  Years_of_Experience   Bonus  \
,count     5.000000   5.000000      5.00000             5.000000     5.0
,mean    103.000000  34.000000  60000.00000             7.400000  5500.0
,std       1.581139   5.612486   7905.69415             3.847077  1000.0
,min     101.000000  28.000000  50000.00000             3.000000  4500.0
,25%     102.000000  29.000000  55000.00000             4.000000  5000.0
,50%     103.000000  34.000000  60000.00000             8.000000  5000.0
,75%     104.000000  38.000000  65000.00000            10.000000  6000.0
,max     105.000000  41.000000  70000.00000            12.000000  7000.0
,
,         Rating
,count  5.000000
,mean   4.100000
,std    0.494975
,min    3.500000
,25%    3.800000
,50%    4.000000
,75%    4.500000
,max    4.700000
,   Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
,0          101    Alice         HR   29   50000                    4
,1          102      Bob         IT   34   70000                    8
,2          103  Charlie         IT   41   65000                   10
,3          104    Diana  Marketing   28   55000                    3
,4          105   Edward      Sales   38   60000                   12
,
,  Joining_date  Gender  Bonus  Rating
,0   2020-03-15  Female   5000     4.5
,1   2017-07-19    Male   7000     4.0
,2   2013-06-01    Male   6000     3.8
,3   2021-02-10  Female   4500     4.7
,4   2010-11-25    Male   5000     3.5
,   Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
,2          103  Charlie         IT   41   65000                   10
,3          104    Diana  Marketing   28   55000                    3
,4          105   Edward      Sales   38   60000                   12
,
,  Joining_date  Gender  Bonus  Rating
,2   2013-06-01    Male   6000     3.8
,3   2021-02-10  Female   4500     4.7
,4   2010-11-25    Male   5000     3.5
,Average Salary: 60000.0
,Total Bonus: 27500
,Minimum Age: 28
,Highest Performance Rating: 4.7
,    ID     Name Department  Age  Salary  Years_of_Experience Joining_date  \
,1  102      Bob         IT   34   70000                    8   2017-07-19
,2  103  Charlie         IT   41   65000                   10   2013-06-01
,4  105   Edward      Sales   38   60000                   12   2010-11-25
,
,  Gender  Bonus  Rating Performance_category
,1   Male   7000     4.0                 Good
,2   Male   6000     3.8              Average
,4   Male   5000     3.5              Average
,    ID     Name Department  Age  Salary  Years_of_Experience Joining_date  \
,1  102      Bob         IT   34   70000                    8   2017-07-19
,2  103  Charlie         IT   41   65000                   10   2013-06-01
,
,  Gender  Bonus  Rating Performance_category
,1   Male   7000     4.0                 Good
,2   Male   6000     3.8              Average